Repository: Minhaj9800/Matrix-Mesh-V2022.02.01
Catalog: assets/l10n/intl_*.arb
Languages: si

source: About
si: පිළිබඳව

source: Accept
si: පිළිගන්න

source: Account
si: ගිණුම

source: Account information
si: ගිණුමේ තොරතුරු

source: Add email
si: වි-තැපෑල එකතු කරන්න

source: Admin
si: පරිපාලක

source: All chats
si: සියලුම සංවාද

source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Anyone can join
si: ඕනෑම කෙනෙකුට එක්විය හැකිය

source: Archive
si: සංරක්ෂිතය

source: Archived Room
si: සංරක්ෂිත කාමරය

# areGuestsAllowedToJoin
source: Are guest users allowed to join
si: ආගන්තුක පරිශීලකයින්ට එක්වීමට අවසර තිබේද

source: Are you sure?
si: ඔබට විශ්වාසද?

source: Are you sure you want to log out?
si: ඔබට නික්මීමට අවශ්‍ය බව විශ්වාසද?

# audioPlayerPlay
source: Play
si: ධාවනය

source: Block Device
si: උපාංගය අවහිර කරන්න

# cachedKeys
source: Keys cached
si: යතුරු නිහිතගතයි

source: Cancel
si: අවලංගු කරන්න

source: Change device name
si: උපාංගයේ නම වෙනස් කරන්න

source: Change password
si: මුරපදය වෙනස් කරන්න

source: Chat
si: සංවාදය

source: Chat backup
si: සංවාද උපස්ථය

source: Chat details
si: සංවාදයේ විස්තර

source: Chats
si: සංවාද

source: Choose a strong password
si: ශක්තිමත් මුරපදයක් තෝරන්න

source: Choose a username
si: පරිශීලක නාමයක් තෝරන්න

source: Clear archive
si: සංරක්ෂිතය හිස් කරන්න

source: Close
si: වසන්න

# commandHint_join
source: Join the given room
si: දී ඇති කාමරයට එක්වන්න

# commandHint_leave
source: Leave this room
si: මෙම කාමරය හැරයන්න

source: Command invalid
si: විධානය වලංගු නොවේ

# commandMissing
source: {command} is not a command.
si: {{command} විධානයක් නොවේ.

# compareEmojiMatch
source: Compare and make sure the following emoji match those of the other device:
si: සසඳා බලා පහත දැක්වෙන ඉමොජි අනෙක් උපාංගයට නිසැකවම ගැලපෙන බවට වග බලා ගන්න:

# compareNumbersMatch
source: Compare and make sure the following numbers match those of the other device:
si: සංසන්දනය කර පහත දැක්වෙන අංක අනෙක් උපාංගට නිසැකව ගැලපෙන බවට වග බලා ගන්න:

source: Confirm
si: තහවුරු කරන්න

source: Connect
si: සබඳින්න

source: Connection attempt failed
si: සබැඳීමේ උත්සාහය අසාර්ථකයි

source: Contact has been invited to the group
si: සමූහය වෙත සබඳතාවයකට ආරාධනා කර ඇත

source: Copy
si: පිටපත්

source: Create
si: සාදන්න

source: Create account now
si: දැන් ගිණුමක් සාදන්න

source: Create new group
si: නව සමූහයක් සාදන්න

source: Donate
si: පරිත්‍යාග

source: Encryption
si: සංකේතාංකනය

source: Everything ready!
si: සියල්ල සූදානම්!

source: Font size
si: මුද්‍රණඅකුරේ ප්‍රමාණය

source: Go to the new room
si: නව කාමරයට යන්න

source: Join room
si: කාමරයට එක්වන්න

# keysCached
source: Keys are cached
si: යතුරු නිහිතගත යි

source: Next
si: ඊලඟ

source: No public rooms found…
si: ප්‍රසිද්ධ කාමර හමු නොවිණි…

source: People
si: මිනිසුන්

source: Public Groups
si: ප්‍රසිද්ධ සමූහ

source: Remove device
si: උපාංගය ඉවත්කරන්න

source: Room version
si: කාමරයේ අනුවාදය

# savedFileAs
source: Saved file as {filename}
si: ලෙස ගොනුව සුරකින්න {filename}

source: Save file
si: ගොනුව සුරකින්න

# saveFileToFolder
source: Save file to this folder
si: ගොනුව මෙම බහාලුමට සුරකින්න

source: Security key
si: ආරක්ෂක යතුර

source: Security key lost?
si: ආරක්ෂක යතුර නැතිවුනාද?

source: Send
si: යවන්න

source: Show password
si: මුරපදය පෙන්වන්න

source: Sunday
si: ඉරිදා

source: Username
si: පරිශීලක නාමය

source: Video call
si: දෘශ්‍ය ඇමතුම

source: Wallpaper
si: බිතුපත

source: Warning!
si: අවවාදයයි!

source: Wednesday
si: බදාදා

source: Write a message…
si: පණිවිඩයක් ලියන්න…

source: Yes
si: ඔව්

source: You
si: ඔබ

source: Your own username
si: ඔබට හිමි පරිශීලකනාමය

source: Zoom in
si: විශාලනය

source: Zoom out
si: කුඩාලනය
